app/controllers/cursos_controller.rb

SELECT "cursos".* FROM "cursos"
---
  def index
    @cursos = Curso.all

INSERT INTO "cursos" ("nome", "descricao", "professor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @curso = Curso.new(curso_params)

    respond_to do |format|
      if @curso.save

DELETE FROM "cursos" WHERE "cursos"."id" = ?  [["id", 3]]
---
  def destroy
    @curso.destroy

SELECT  "cursos".* FROM "cursos" WHERE "cursos"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_curso
      @curso = Curso.find(params[:id])