app/controllers/notas_controller.rb

SELECT "notas".* FROM "notas"
---
  def index
    @notas = Nota.all

INSERT INTO "notas" ("inscricao_id", "curso_id", "nota", "frequencia", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["inscricao_id", 1], ["curso_id", 1], ["nota", 3.9], ["frequencia", "10"], ["created_at", "2016-05-04 22:39:44.990176"], ["updated_at", "2016-05-04 22:39:44.990176"]]
---
  def create
    @nota = Nota.new(nota_params)

    respond_to do |format|
      if @nota.save

DELETE FROM "notas" WHERE "notas"."id" = ?  [["id", 1]]
---
  def destroy
    @nota.destroy

SELECT  "notas".* FROM "notas" WHERE "notas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_nota
      @nota = Nota.find(params[:id])