app/controllers/turmas_controller.rb

  def index
    @turmas = Turma.all
---
SELECT "turmas".* FROM "turmas"

  def create
    @turma = Turma.new(turma_params)

    respond_to do |format|
      if @turma.save
---
INSERT INTO "turmas" ("inscricao_id", "curso_id", "professor_id", "turma", "sala", "data_ini", "data_ter", "turno", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_turma
      @turma = Turma.find(params[:id])
---
SELECT  "turmas".* FROM "turmas" WHERE "turmas"."id" = ? LIMIT 1  [["id", 1]]